In [1]:
import pymysql
import pandas as pd

In [2]:
host_name = 'localhost'
host_port = 3306
username = 'root'
password = '123123'
database_name = 'sqlDB'

In [3]:
db = pymysql.connect(
    host=host_name,     # MySQL Server Address
    port=host_port,          # MySQL Server Port
    user=username,      # MySQL username
    passwd=password,    # password for MySQL username
    db=database_name,   # Database name
    charset='utf8'
)

In [4]:
#유저 테이블 레코드 검색
SQL = "select * from userTbl"
df = pd.read_sql(SQL, db)
df

  userID name  birthYear addr mobile1   mobile2  height       mDate
0    BBK  바비킴       1973   서울     010  00000000     176  2013-05-05
1    EJW  은지원       1972   경북     011  88888888     174  2014-03-03
2    JKW  조관우       1965   경기     016  99999999     172  2010-10-10
3    JYP  조용필       1950   경기     011  44444444     166  2009-04-04
4    KBS  김범수       1979   경남     011  22222222     173  2012-04-04
5    KKH  김경호       1971   전남     019  33333333     177  2007-07-07
6    LJB  임재범       1963   서울     016  66666666     182  2009-09-09
7    LSG  이승기       1987   서울     011  11111111     182  2008-08-08
8    SSK  성시경       1979   서울    None      None     186  2013-12-12
9    YJS  윤종신       1960   경남    None      None     170  2005-05-05

In [8]:
#제품 테이블 레코드 검색
SQL = "select * from buyTbl"
df = pd.read_sql(SQL, db)
df

    num userID prodName groupName  price  amount
0     1    KBS      운동화        의류     30       2
1     2    KBS      노트북        전자   1000       1
2     3    JYP      모니터        전자    200       1
3     4    BBK      모니터        전자    200       5
4     5    KBS      청바지        의류     50       3
5     6    BBK      메모리        전자     80      10
6     7    SSK        책        서적     15       5
7     8    EJW        책        서적     15       2
8     9    EJW      청바지        의류     50       1
9    10    BBK      운동화        의류     30       2
10   11    EJW        책        서적     15       1
11   12    BBK      운동화        의류     30       2
12   14    BBK      운동화        의류     30       2

In [6]:
cursor = db.cursor()
SQL_QUERY = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('STQ', '운동화', '의류', 30, 2);"
cursor.execute(SQL_QUERY)
db.commit()

#무결성의 원칙을 지켜야 한다!!!
#에러가 나는 이유? buy테이블에서 userID는 user테이블에서의 외래키. 근데 STQ라는 user테이블의 userID를 참조한다. 
#근데 user테이블에 userID에 STJ가 없기 때문에 에러가 발생한다.

IntegrityError: (1452, 'Cannot add or update a child row: a foreign key constraint fails (`sqldb`.`buytbl`, CONSTRAINT `buytbl_ibfk_1` FOREIGN KEY (`userID`) REFERENCES `usertbl` (`userID`))')

In [7]:
cursor = db.cursor()
SQL_QUERY = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('BBK', '운동화', '의류', 30, 2);"
cursor.execute(SQL_QUERY)
db.commit()

In [9]:
#STJ라는 데이터를 넣기 위해서 user테이블에 STJ값을 넣어준다. 무결성을 맞추기 위해서
cursor = db.cursor()
SQL_QUERY = "INSERT INTO userTbl VALUES('STJ', '서태지', 1975, '경기', '011', '00000000', 171, '2014-4-4');"
cursor.execute(SQL_QUERY)
db.commit()

In [10]:
SQL_QUERY = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('STJ', '운동화', '의류', 30, 2);"
cursor.execute(SQL_QUERY)
db.commit()

#이제는 에러가 안 난다.

In [ ]:
#이번에는 userTbl에 userID가 STJ 관련 데이터를 삭제해본다. 
#buyTbl 에 해당 userID를 참조하는 데이터가 있기 때문입니다.
SQL_QUERY = "DELETE FROM userTbl WHERE userID = 'STJ'"
cursor.execute(SQL_QUERY)
db.commit()